In [1]:
import pandas as pd
import numpy as np

In [2]:
data = pd.read_csv("summer.csv")
data.head()

,Year,City,Sport,Discipline,Athlete,Country,Gender,Event,Medal
0,1896,Athens,Aquatics,Swimming,"HAJOS, Alfred",HUN,Men,100M Freestyle,Gold
1,1896,Athens,Aquatics,Swimming,"HERSCHMANN, Otto",AUT,Men,100M Freestyle,Silver
2,1896,Athens,Aquatics,Swimming,"DRIVAS, Dimitrios",GRE,Men,100M Freestyle For Sailors,Bronze
3,1896,Athens,Aquatics,Swimming,"MALOKINIS, Ioannis",GRE,Men,100M Freestyle For Sailors,Gold
4,1896,Athens,Aquatics,Swimming,"CHASAPIS, Spiridon",GRE,Men,100M Freestyle For Sailors,Silver

In [3]:
data["Country"].nunique()

147

In [4]:
data['City'].nunique()

22

In [5]:
data.Medal.value_counts()

Gold      10486
Bronze    10369
Silver    10310
Name: Medal, dtype: int64

In [6]:
df = data[data['Medal']=='Gold']

In [7]:
df.groupby("Sport")["Medal"].value_counts().sort_values(ascending = False).head()

Sport       Medal
Aquatics    Gold     1421
Athletics   Gold     1215
Rowing      Gold      890
Gymnastics  Gold      820
Fencing     Gold      552
Name: Medal, dtype: int64

In [8]:
data.groupby("Sport")["Medal"].count().sort_values(ascending = False).head(5)

Sport
Aquatics      4170
Athletics     3638
Rowing        2667
Gymnastics    2307
Fencing       1613
Name: Medal, dtype: int64

In [9]:
data.groupby("Athlete")["Medal"].count().sort_values(ascending = False).head(5)

Athlete
PHELPS, Michael         22
LATYNINA, Larisa        18
ANDRIANOV, Nikolay      15
MANGIAROTTI, Edoardo    13
SHAKHLIN, Boris         13
Name: Medal, dtype: int64

In [10]:
df.groupby("Athlete")["Medal"].value_counts().sort_values(ascending = False).head(5)

Athlete           Medal
PHELPS, Michael   Gold     18
NURMI, Paavo      Gold      9
SPITZ, Mark       Gold      9
LEWIS, Carl       Gold      9
LATYNINA, Larisa  Gold      9
Name: Medal, dtype: int64

In [11]:
df_gen = df[df['Gender']=='Women']
df_gen.head()

,Year,City,Sport,Discipline,Athlete,Country,Gender,Event,Medal
417,1900,Paris,Golf,Golf,"ABBOTT, Margaret Ives",USA,Women,Individual,Gold
641,1900,Paris,Tennis,Tennis,"COOPER, Charlotte",GBR,Women,Mixed Doubles,Gold
649,1900,Paris,Tennis,Tennis,"COOPER, Charlotte",GBR,Women,Singles,Gold
710,1904,St Louis,Archery,Archery,"HOWELL, Matilda Scott",USA,Women,Double Columbia Round (50Y - 40Y - 30Y),Gold
713,1904,St Louis,Archery,Archery,"HOWELL, Matilda Scott",USA,Women,Double National Round (60Y - 50Y),Gold

In [12]:
df_gen.groupby(["Medal","Sport"])["Gender"].value_counts().sort_values(ascending = False).head(5)

Medal  Sport       Gender
Gold   Aquatics    Women     589
       Athletics   Women     389
       Gymnastics  Women     268
       Rowing      Women     217
       Volleyball  Women     166
Name: Gender, dtype: int64

In [13]:
data.groupby("Event")["Gender"].count().sort_values(ascending = False).head(5)

Event
Football            1497
Hockey              1422
Team Competition    1147
Basketball          1012
Handball             973
Name: Gender, dtype: int64

In [14]:
df_con = df.loc[data.Country=="IND"]
df_con.head()

,Year,City,Sport,Discipline,Athlete,Country,Gender,Event,Medal
5512,1928,Amsterdam,Hockey,Hockey,"ALLEN, Richard James",IND,Men,Hockey,Gold
5513,1928,Amsterdam,Hockey,Hockey,"CHAND, Dyan",IND,Men,Hockey,Gold
5514,1928,Amsterdam,Hockey,Hockey,"GATELEY, Maurice A.",IND,Men,Hockey,Gold
5515,1928,Amsterdam,Hockey,Hockey,"GILL, K. S.",IND,Men,Hockey,Gold
5516,1928,Amsterdam,Hockey,Hockey,"GOODSIR-CULLEN, William John",IND,Men,Hockey,Gold

In [15]:
df_con.groupby('Country')['Country','Medal','Year', 'Sport'].head()

C:\Users\Anurag\anaconda3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: Indexing with multiple keys (implicitly converted to a tuple of keys) will be deprecated, use a list instead.
  """Entry point for launching an IPython kernel.

     Country Medal  Year   Sport
5512     IND  Gold  1928  Hockey
5513     IND  Gold  1928  Hockey
5514     IND  Gold  1928  Hockey
5515     IND  Gold  1928  Hockey
5516     IND  Gold  1928  Hockey

# The End!